# 7.1 Handling Missing Data

In [175]:
import pandas as pd
import numpy as np

In [176]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## Filtering Out Missing Data

In [4]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [7]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [9]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.153397       NaN       NaN
1 -1.675912       NaN       NaN
2 -0.496069       NaN  0.430602
3  1.399740       NaN  1.074834
4  0.783376 -0.031576  0.953130
5  0.034828 -0.403080 -1.610396
6  0.757497 -1.432415  0.811361

In [11]:
df.dropna()

          0         1         2
4  0.783376 -0.031576  0.953130
5  0.034828 -0.403080 -1.610396
6  0.757497 -1.432415  0.811361

In [12]:
df.dropna(thresh=2)

          0         1         2
2 -0.496069       NaN  0.430602
3  1.399740       NaN  1.074834
4  0.783376 -0.031576  0.953130
5  0.034828 -0.403080 -1.610396
6  0.757497 -1.432415  0.811361

## Filling In missing Data

In [13]:
df.fillna(0)

          0         1         2
0 -0.153397  0.000000  0.000000
1 -1.675912  0.000000  0.000000
2 -0.496069  0.000000  0.430602
3  1.399740  0.000000  1.074834
4  0.783376 -0.031576  0.953130
5  0.034828 -0.403080 -1.610396
6  0.757497 -1.432415  0.811361

In [21]:
df.fillna(value=0) # Same as Above

          0         1         2
0  0.682535  0.174446  0.368876
1  0.086688  0.165547  0.569369
2  0.962420  0.000000  0.303971
3  0.071139  0.000000  0.102775
4  0.023116  0.000000  0.000000
5  0.925345  0.000000  0.000000

In [14]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.153397  0.500000  0.000000
1 -1.675912  0.500000  0.000000
2 -0.496069  0.500000  0.430602
3  1.399740  0.500000  1.074834
4  0.783376 -0.031576  0.953130
5  0.034828 -0.403080 -1.610396
6  0.757497 -1.432415  0.811361

In [15]:
df.fillna(0, inplace=True)

In [16]:
df = pd.DataFrame(np.random.rand(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.682535  0.174446  0.368876
1  0.086688  0.165547  0.569369
2  0.962420       NaN  0.303971
3  0.071139       NaN  0.102775
4  0.023116       NaN       NaN
5  0.925345       NaN       NaN

In [17]:
df.fillna(method='ffill')

          0         1         2
0  0.682535  0.174446  0.368876
1  0.086688  0.165547  0.569369
2  0.962420  0.165547  0.303971
3  0.071139  0.165547  0.102775
4  0.023116  0.165547  0.102775
5  0.925345  0.165547  0.102775

In [18]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.682535  0.174446  0.368876
1  0.086688  0.165547  0.569369
2  0.962420  0.165547  0.303971
3  0.071139  0.165547  0.102775
4  0.023116       NaN  0.102775
5  0.925345       NaN  0.102775

In [19]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

In [22]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 2, 3, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   3
4  one   3
5  two   4
6  two   4

In [24]:
data.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [25]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   3
5  two   4

In [29]:
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   2
2  one   3
3  two   3
5  two   4

In [30]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   2   1

In [32]:
data

    k1  k2  v1
0  one   1   0
1  two   2   1
2  one   3   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.duplicated(['k1', 'k2'], keep='last')

0    False
1    False
2     True
3    False
4    False
5     True
6    False
dtype: bool

In [35]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   2   1
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [40]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
    'bacon': 'pig', 
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon',    
}
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [45]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [47]:
data = pd.Series([1., -999, 2., -999, -1000, 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [48]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0.0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999: np.nan, -1000: 0.0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [56]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [61]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# Divide ages into bins of 18-25, 26-35, 36-60 & finally 61 and older.
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [67]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [68]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [70]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [75]:
cats2 = pd.cut(ages, bins, right=False)
cats2

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [76]:
cats2.categories

IntervalIndex([[18, 25), [25, 35), [35, 60), [60, 100)],
              closed='left',
              dtype='interval[int64]')

In [77]:
# Your own bin names
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [79]:
# If you pass an integer of  bins to cut(like 4 bins here) instead of explicit bin edge, it will compute 
# equal length bins based on the min and max values in the data 
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.00047, 0.24], (0.00047, 0.24], (0.48, 0.72], (0.24, 0.48], (0.24, 0.48], ..., (0.48, 0.72], (0.24, 0.48], (0.48, 0.72], (0.48, 0.72], (0.72, 0.96]]
Length: 20
Categories (4, interval[float64]): [(0.00047, 0.24] < (0.24, 0.48] < (0.48, 0.72] < (0.72, 0.96]]

In [80]:
data = np.random.rand(100) # Normally Distributed
cats = pd.qcut(data, 4)    # Cut into quartiles
cats

[(0.527, 0.808], (0.527, 0.808], (0.277, 0.527], (0.808, 0.991], (0.277, 0.527], ..., (-0.000789, 0.277], (-0.000789, 0.277], (0.277, 0.527], (0.527, 0.808], (0.527, 0.808]]
Length: 100
Categories (4, interval[float64]): [(-0.000789, 0.277] < (0.277, 0.527] < (0.527, 0.808] < (0.808, 0.991]]

In [81]:
pd.value_counts(cats)

(0.808, 0.991]        25
(0.527, 0.808]        25
(0.277, 0.527]        25
(-0.000789, 0.277]    25
dtype: int64

In [83]:
# You can pass your own quantiles (number between 0 and 1, inclusive)
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(0.527, 0.878], (0.527, 0.878], (0.0943, 0.527], (0.527, 0.878], (0.0943, 0.527], ..., (-0.000789, 0.0943], (-0.000789, 0.0943], (0.0943, 0.527], (0.527, 0.878], (0.527, 0.878]]
Length: 100
Categories (4, interval[float64]): [(-0.000789, 0.0943] < (0.0943, 0.527] < (0.527, 0.878] < (0.878, 0.991]]

## Detecting and Filtering Outliers

In [100]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.012339     0.015493     0.012069     0.010654
std       1.018193     0.962034     0.991029     0.968727
min      -3.389513    -3.684258    -2.705350    -3.516869
25%      -0.713376    -0.612485    -0.669149    -0.596340
50%       0.033449     0.028699     0.003328    -0.007490
75%       0.693711     0.678229     0.668082     0.640397
max       2.865431     2.772868     3.646059     3.173019

In [111]:
col = data[2]
col[np.abs(col) > 3]

290    3.297968
291    3.646059
648    3.420552
706    3.075045
982    3.193967
Name: 2, dtype: float64

In [114]:
data[(np.abs(data) > 3).any(1)] # mask gives True/False value for EACH row, if condition is met in any cell of row.

            0         1         2         3
148 -3.389513  0.783124  0.573001 -0.264162
257  0.730240 -3.684258  1.749218 -0.914730
290 -1.143793  0.470637  3.297968  0.765002
291  1.162805  0.868135  3.646059  0.069379
337  1.301893 -1.189080  0.018539  3.040039
514 -0.383791  0.382417  1.006491 -3.516869
648 -1.016454 -1.647536  3.420552 -0.017381
655  0.079037 -3.217360  1.205548  0.382778
706 -1.098741  1.159422  3.075045  0.328677
718 -1.134845 -1.245058  0.699150  3.173019
982 -0.313418 -0.296432  3.193967 -0.173732

In [117]:
# Cap values outside the interval -3 to 3
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.012729     0.016394     0.010435     0.010957
std       1.016964     0.958932     0.985717     0.966304
min      -3.000000    -3.000000    -2.705350    -3.000000
25%      -0.713376    -0.612485    -0.669149    -0.596340
50%       0.033449     0.028699     0.003328    -0.007490
75%       0.693711     0.678229     0.668082     0.640397
max       2.865431     2.772868     3.000000     3.000000

In [118]:
np.sign(data)

       0    1    2    3
0   -1.0 -1.0  1.0 -1.0
1    1.0 -1.0 -1.0  1.0
2    1.0  1.0 -1.0 -1.0
3   -1.0  1.0  1.0 -1.0
4   -1.0  1.0 -1.0 -1.0
..   ...  ...  ...  ...
995  1.0  1.0 -1.0  1.0
996 -1.0 -1.0 -1.0  1.0
997  1.0  1.0  1.0  1.0
998 -1.0  1.0  1.0 -1.0
999  1.0 -1.0 -1.0 -1.0

[1000 rows x 4 columns]

In [121]:
data[np.abs(data) > 3]   # Give NaN  on False, else the value if True, since inside condition result given below.

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [122]:
np.abs(data) > 3    # Set values T/F on each cell depending on the condition

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [124]:
(np.abs(data) > 3).any(1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

## Permutation and Random Sampling

In [125]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5) # Where 5 is the no. of rows in df.
sampler

array([3, 2, 1, 0, 4])

In [126]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [127]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19

In [128]:
df.sample(n=3) # To select a random subset without replacement, on Series & df

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7

In [130]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True) # To select a sample with replacement (to allow repeat choice).
draws

1    7
2   -1
0    5
1    7
3    6
2   -1
0    5
0    5
4    4
1    7
dtype: int64

## Computing Indicator/Dummy Values

In [133]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

# Coverting the categorical column to "indicator" matrix, 
# Column represent each category; rows, instaces. 
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [134]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [135]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [142]:
# Multiple categories in a row
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::', header=None, names=mnames)
movies.head()

C:\anaconda3\lib\site-packages\pandas\io\parsers.py:765: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [144]:
all_genres = []
for genres in movies.genres:
    # The extend() method adds all the elements of an iterable (list, tuple, string etc.) to the end of the list.
    # list1.extend(iterable)
    all_genres.extend(genres.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [146]:
# CREATING INDICATOR DF
# Create a df of zeros with columns as genres.
zero_matrix = np.zeros( (len(movies), len(genres)) )
dummies = pd.DataFrame(zero_matrix, columns=genres)

# Now iterate through each movie and set entries in each row of dummies to 1.
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [147]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [148]:
# We can use iloc to set values based on these indices
for i, genre in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(genre.split('|'))
    dummies.iloc[i, indices] = 1
    
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [150]:
# A useful reciepe for statistical application is to combine get_dummies with a discretization function like cut.
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [151]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## String Object Methods

In [152]:
val = 'a,b,   guido'
val.split(',')

['a', 'b', '   guido']

In [153]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [154]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [155]:
# use join on the string to put in between
'::'.join(pieces)

'a::b::guido'

In [156]:
# in keyword to detect substring
'guido' in val

True

In [159]:
# index raises as exception if the string is not found, versus returning it.
print(val.index(','))
print(val.find(':'))

1
-1

In [160]:
val.index(':')

ValueError: substring not found

In [161]:
# count returns the number of occurances of particular substring
val.count(',')

2

In [162]:
val.replace(',','::')

'a::b::   guido'

In [164]:
val.replace(',','')

'ab   guido'

## Regular Expressions

In [182]:
import re
text = "foo     bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [178]:
# Comiling the regex, forming a resusable regex object
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [184]:
regex.findall(text)

['     ', '\t ', '  \t']

In [196]:
# findall returns all matches
# search returns only the first match
# match  only matches at beginning of the string 

text="""Dave dave@google.com
Steve steve@google.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

regex.findall(text)

['dave@google.com', 'steve@google.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [197]:
m = regex.search(text)
m

In [198]:
text[m.start() : m.end()]

'dave@google.com'

In [199]:
# regex.match returns None, as it will only match if the pattern occurs at the start of the string.
print(regex.match(text))

None

In [201]:
print(regex.sub('REPLACED_TEXT', text))

Dave REPLACED_TEXT
Steve REPLACED_TEXT
Rob REPLACED_TEXT
Ryan REPLACED_TEXT

In [209]:
# Put paranthesis around the parts of the pattern to extract
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags = re.IGNORECASE)
m = regex.match('wesm@bright.net') 
m.groups()

('wesm', 'bright', 'net')

In [207]:
# findall returns tuples when patterns has segment to extract
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'google', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [210]:
print(regex.sub('userName: \1, Domain: \2, Suffix: \3', text))

Dave userName: , Domain: , Suffix: 
Steve userName: , Domain: , Suffix: 
Rob userName: , Domain: , Suffix: 
Ryan userName: , Domain: , Suffix: 

## Vectorized String Functions in Pandas

In [211]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [212]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [213]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [214]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [215]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [223]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [225]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [234]:
data.str.center(width=4)

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object